Tekla Open API Reference for Tekla Structures 2025
StraightDimension.Value Property
 Gets the content of the dimension mark.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ContainerElement Value { get; }
Public ReadOnly Property Value As ContainerElement
	Get
Property Value
Type: ContainerElement
See Also
Reference
StraightDimension Class
Tekla.Structures.Drawing Namespace